## **PANDAS: INTRODUCTION**
> It is often said that 80% of data analysis is spent on the data cleaning and preparing data. To get a handle on the problem, this section focuses on a small, but important aspect of data manipulation and cleaning with Pandas.
### **Data Structures**
**There are two data structures are there in Pandas -**<br>
* **Series -** It is one-dimensional labeled array capable of holding any data type (integer, strings, floating point numbers, Python objects etc.) of data. The axis is collectively referred to as index.

* **Data Frame -** It is a two-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL Table or a Series of objects.

### **Series Data Structure:**
**pandas.core.series.Series(data, index, dtype, copy)**<br>
* **data -** data takes various forms like ndarray, list, constants, dictionary etc.<br>
* **index -** it is unique and hashable for easy identification.<br>
* **dtype -** it is for data type.<br>
* **copy -** copy data, and its default value is False. It only affects for Series on one dimensional ndarray inputs.

In [1]:
# importing required modules
import pandas as pd
import numpy as np

In [7]:
# creating empty Series
import warnings
warnings.filterwarnings('ignore')
s = pd.Series()
print (s, type(s))

Series([], dtype: float64) <class 'pandas.core.series.Series'>

In [4]:
# create a Series from a ndarray
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
s = pd.Series(data = arr_data)
print (s, type(s), s[0], s[3])

0        apple
1       banana
2       cherry
3    pineapple
dtype: object <class 'pandas.core.series.Series'> apple pineapple

In [12]:
arr_data = np.array([100, 300, 200, 600, 500])
s = pd.Series(arr_data, copy = False)
s[0] = 999; arr_data[2] = 888
print (arr_data, type(arr_data), "\n", s, type(s))

arr_data = np.array([100, 300, 200, 600, 500])
s = pd.Series(arr_data, copy = True)
s[0] = 999; arr_data[2] = 888
print (arr_data, type(arr_data), "\n", s, type(s))

[999 300 888 600 500] <class 'numpy.ndarray'>
 0    999
1    300
2    888
3    600
4    500
dtype: int32 <class 'pandas.core.series.Series'>
[100 300 888 600 500] <class 'numpy.ndarray'>
 0    999
1    300
2    200
3    600
4    500
dtype: int32 <class 'pandas.core.series.Series'>

In [15]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, type(arr_data))

s = pd.Series(data = arr_data, index = [100, 101, 102, 103])
print (s)
print (s[100], type(s[100]), s[103], type(s[103]))

['apple' 'banana' 'cherry' 'pineapple'] <class 'numpy.ndarray'>
100        apple
101       banana
102       cherry
103    pineapple
dtype: object
apple <class 'str'> pineapple <class 'str'>

In [19]:
s = pd.Series(data = arr_data, index = [100, 101, 100, 103])
print (s)
print (s[100], type(s[100]), s[103], type(s[103]))

100        apple
101       banana
100       cherry
103    pineapple
dtype: object
100     apple
100    cherry
dtype: object <class 'pandas.core.series.Series'> pineapple <class 'str'>

In [17]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
s = pd.Series(data = arr_data, index = ['fruit-1', 'fruit-2', 'fruit-3', 'fruit-4'])
print (s)
print (s['fruit-1'], s[0], s['fruit-3'], s[2])

fruit-1        apple
fruit-2       banana
fruit-3       cherry
fruit-4    pineapple
dtype: object
apple apple cherry cherry

In [21]:
# create a Series from a dictionary
dict_data = {'apple':100, 'banana':202, 'coconut':450, 'mango':435}
s = pd.Series(dict_data)
print (s)
s = pd.Series(dict_data, index = ['banana', 'mango', 'apple', 'coconut'])
print (s)

apple      100
banana     202
coconut    450
mango      435
dtype: int64
banana     202
mango      435
apple      100
coconut    450
dtype: int64

In [24]:
dict_data = {'apple':100, 'banana':202, 'coconut':450, 'mango':435}
s = pd.Series(dict_data, index = ['banana', 'mango', 'apple', 'coconut'])
print (s)
s = pd.Series(data = dict_data, index = 
                    ['banana', 'lime', 'coconut', 'mango', 'guava', 'apple', 'mango', 'apple', 'coconut'])
print (s)
print (s['banana'], s['lime'], s[4], s[5])

banana     202
mango      435
apple      100
coconut    450
dtype: int64
banana     202.0
lime         NaN
coconut    450.0
mango      435.0
guava        NaN
apple      100.0
mango      435.0
apple      100.0
coconut    450.0
dtype: float64
202.0 nan nan 100.0

In [25]:
# create a Series from a scalar
s = pd.Series(5, index = [0, 1, 2, 3, 4])
print(s)
s = pd.Series(5, index = [0, 1, 2, 0, 1, 2])
print(s)

0    5
1    5
2    5
3    5
4    5
dtype: int64
0    5
1    5
2    5
0    5
1    5
2    5
dtype: int64

In [33]:
# Create a Series from a list
s = pd.Series(data = [101, 303, 202, 404, 505], index = ['red', 'blue', 'brown', 'black', 'silver'])
print (s)

red       101
blue      303
brown     202
black     404
silver    505
dtype: int64

In [33]:
# Create a Series from a list
s = pd.Series(data = [101, 303, 202, 404, 505], index = ['red', 'blue', 'brown', 'black', 'silver'])
print (s)

red       101
blue      303
brown     202
black     404
silver    505
dtype: int64

#### Data Frame Data Structure:

#### Create DataFrame

In [7]:
data_dict = {'emp_name':['Amal', 'Kamal', 'Bimal', 'Shyamal'], 'emp_age':[34, 35, 45, 43]}
df = pd.DataFrame(data_dict)
df

  emp_name  emp_age
0     Amal       34
1    Kamal       35
2    Bimal       45
3  Shyamal       43

In [8]:
data_dict = {'emp_name':['Amal', 'Kamal', 'Bimal', 'Shyamal'], 'emp_age':[34, 35, 45, 43]}
df = pd.DataFrame(data = data_dict)
df

  emp_name  emp_age
0     Amal       34
1    Kamal       35
2    Bimal       45
3  Shyamal       43

In [17]:
data_dict = {'emp_name':['Amal', 'Kamal', 'Bimal', 'Shyamal'], 'emp_age':[34, 35, 45, 43]}
emp_id = [100, 101, 102, 103]
df = pd.DataFrame(data = data_dict, index = emp_id)
df

    emp_name  emp_age
100     Amal       34
101    Kamal       35
102    Bimal       45
103  Shyamal       43

In [18]:
data_dict = {'emp_name':['Amal', 'Kamal', 'Bimal', 'Shyamal'], 'emp_age':[34, 35, 45, 43]}
emp_id = [100, 101, 102, 103]
df = pd.DataFrame(data = data_dict, index = emp_id)
print (df)
df = df.reset_index()
df

    emp_name  emp_age
100     Amal       34
101    Kamal       35
102    Bimal       45
103  Shyamal       43

   index emp_name  emp_age
0    100     Amal       34
1    101    Kamal       35
2    102    Bimal       45
3    103  Shyamal       43

In [19]:
user_data = [['alice', 19, 'F', 'student'], ['john', 26, 'M', 'student']]  # list of lists
user1 = pd.DataFrame(user_data)
user1

       0   1  2        3
0  alice  19  F  student
1   john  26  M  student

In [18]:
user_data = [['alice', 19, 'F', 'student'], ['john', 26, 'M', 'student']]  # list of lists
user_columns = ['name', 'age', 'gender', 'job']
user1 = pd.DataFrame(data = user_data, columns = user_columns)
user1

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student

In [19]:
user_data = dict(name = ['eric', 'paul'], age = [22, 58], gender = ['M', 'F'], job = ['student', 'manager'])
print (user_data)
user2 = pd.DataFrame(data = user_data)
user2

{'name': ['eric', 'paul'], 'age': [22, 58], 'gender': ['M', 'F'], 'job': ['student', 'manager']}

   name  age gender      job
0  eric   22      M  student
1  paul   58      F  manager

In [4]:
user_data = {'name': ['peter', 'julie'], 'age': [33, 44], 'gender': ['M', 'F'], 'job': ['engineer', 'scientist']}
user3 = pd.DataFrame(data = user_data)
user3

    name  age gender        job
0  peter   33      M   engineer
1  julie   44      F  scientist

#### Concatenate DataFrame

In [20]:
print (user1)
print ()
print (user2)
print ()
print (user3)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student

   name  age gender      job
0  eric   22      M  student
1  paul   58      F  manager

    name  age gender        job
0  peter   33      M   engineer
1  julie   44      F  scientist

In [8]:
users = user1.append(user2)
users

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
0   eric   22      M  student
1   paul   58      F  manager

In [9]:
users = user1.append(user2, ignore_index = True)
users

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student
3   paul   58      F  manager

In [10]:
users = users.append(user3, ignore_index = True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [11]:
users = user1.append(user2).append(user3, ignore_index = True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [21]:
users = pd.concat([user1, user2, user3])
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
0   eric   22      M    student
1   paul   58      F    manager
0  peter   33      M   engineer
1  julie   44      F  scientist

In [24]:
users = pd.concat([user1, user2, user3], ignore_index = True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

### DataFrame to NumPy ndarray

In [26]:
user1

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student

In [29]:
arr_data = user1[['name', 'job']].to_numpy()
print (arr_data, type(arr_data))

[['alice' 'student']
 ['john' 'student']] <class 'numpy.ndarray'>

In [30]:
arr_data = user1.to_numpy()
print (arr_data, type(arr_data), arr_data.ndim, arr_data.size)

[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']] <class 'numpy.ndarray'> 2 8

In [31]:
arr_data = np.array(user1)
print (arr_data, type(arr_data))

[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']] <class 'numpy.ndarray'>

## Join DataFrame

In [32]:
dict_data = dict(name = ['alice', 'john', 'eric', 'julie', 'anderson'], height = [165, 180, 175, 171, 169])
user4 = pd.DataFrame(data = dict_data)
user4

       name  height
0     alice     165
1      john     180
2      eric     175
3     julie     171
4  anderson     169

In [33]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [34]:
# inner join: All common rows from both data frames
merge_inner = pd.merge(users, user4, on = "name", how = "inner")
merge_inner

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     171

In [36]:
merge_inner = pd.merge(users, user4, on = "name")  # by default inner join will take place
merge_inner

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     171

In [37]:
# outer join: All rows from both data frames
merge_outer = pd.merge(users, user4, on = "name", how = "outer")
merge_outer

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0

In [38]:
# left outer join: All rows from the left data frame and matching rows from the right data frame
merge_left = pd.merge(users, user4, on = "name", how = "left")
merge_left

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [69]:
# right outer join: Only matching rows from the left data frame and all rows from the right data frame
merge_right = pd.merge(users, user4, on = "name", how = "right")
print (merge_right.size)
merge_right

25

       name   age gender        job  height
0     alice  19.0      F    student     165
1      john  26.0      M    student     180
2      eric  22.0      M    student     175
3     julie  44.0      F  scientist     171
4  anderson   NaN    NaN        NaN     169

## Summarizing

In [40]:
print (type(users))
users

<class 'pandas.core.frame.DataFrame'>

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [41]:
users.head()

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
3   paul   58      F   manager
4  peter   33      M  engineer

In [42]:
users.head(3)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [43]:
users.tail()

    name  age gender        job
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [44]:
users.tail(3)

    name  age gender        job
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [55]:
users.sample()

   name  age gender      job
3  paul   58      F  manager

In [58]:
users.sample(3)

    name  age gender      job
2   eric   22      M  student
0  alice   19      F  student
1   john   26      M  student

In [61]:
print (type(users.any()))
users.any()

<class 'pandas.core.series.Series'>

name      True
age       True
gender    True
job       True
dtype: bool

In [62]:
print (users.index)
print (users.columns)

RangeIndex(start=0, stop=6, step=1)
Index(['name', 'age', 'gender', 'job'], dtype='object')

In [64]:
print (users.dtypes)
print (type(users.dtypes))

name      object
age        int64
gender    object
job       object
dtype: object
<class 'pandas.core.series.Series'>

In [66]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [65]:
print (users.shape)
print (f"So the Row# = {users.shape[0]} and Col# = {users.shape[1]}")

(6, 4)
So the Row# = 6 and Col# = 4

In [67]:
print (users.values)
print (type(users.values), users.values.ndim, users.values.shape, users.values.size)

[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']
 ['eric' 22 'M' 'student']
 ['paul' 58 'F' 'manager']
 ['peter' 33 'M' 'engineer']
 ['julie' 44 'F' 'scientist']]
<class 'numpy.ndarray'> 2 (6, 4) 24

In [71]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [73]:
print (users.job.value_counts())
print ()
print (users.gender.value_counts())

student      3
manager      1
engineer     1
scientist    1
Name: job, dtype: int64

F    3
M    3
Name: gender, dtype: int64

In [74]:
users.describe()

             age
count   6.000000
mean   33.666667
std    14.895189
min    19.000000
25%    23.000000
50%    29.500000
75%    41.250000
max    58.000000

In [75]:
users.describe(include=['object'])

         name gender      job
count       6      6        6
unique      6      2        4
top     alice      F  student
freq        1      3        3

In [76]:
users.describe(include = 'all')

         name        age gender      job
count       6   6.000000      6        6
unique      6        NaN      2        4
top     alice        NaN      F  student
freq        1        NaN      3        3
mean      NaN  33.666667    NaN      NaN
std       NaN  14.895189    NaN      NaN
min       NaN  19.000000    NaN      NaN
25%       NaN  23.000000    NaN      NaN
50%       NaN  29.500000    NaN      NaN
75%       NaN  41.250000    NaN      NaN
max       NaN  58.000000    NaN      NaN

In [77]:
users.describe(include = 'all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
name,6,6,alice,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,6.0,NaN,NaN,NaN,33.666667,14.895189,19.0,23.0,29.5,41.25,58.0
gender,6,2,F,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
job,6,4,student,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [78]:
users.describe(include = 'all').transpose()

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
name,6,6,alice,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,6.0,NaN,NaN,NaN,33.666667,14.895189,19.0,23.0,29.5,41.25,58.0
gender,6,2,F,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
job,6,4,student,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [79]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

In [80]:
merge_outer.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     6 non-null      float64
 2   gender  6 non-null      object
 3   job     6 non-null      object
 4   height  5 non-null      float64
dtypes: float64(2), object(3)
memory usage: 336.0+ bytes

## Column Selection

In [82]:
print (users.job)
print (type(users.job))

0      student
1      student
2      student
3      manager
4     engineer
5    scientist
Name: job, dtype: object
<class 'pandas.core.series.Series'>

In [84]:
print (users['job'])
print (type(users['job']))

0      student
1      student
2      student
3      manager
4     engineer
5    scientist
Name: job, dtype: object
<class 'pandas.core.series.Series'>

In [88]:
users[['job', 'age']]

         job  age
0    student   19
1    student   26
2    student   22
3    manager   58
4   engineer   33
5  scientist   44

In [89]:
my_cols = ['age', 'job']
users[my_cols]

   age        job
0   19    student
1   26    student
2   22    student
3   58    manager
4   33   engineer
5   44  scientist

## Row Selection

In [92]:
df = users.copy()
print (df)
print ()
print (df.iloc[3])
print (type(df.iloc[3]))

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

name         paul
age            58
gender          F
job       manager
Name: 3, dtype: object
<class 'pandas.core.series.Series'>

In [93]:
df = users.copy()
print (df)
print ()
print (df.loc[3])
print (type(df.loc[3]))

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

name         paul
age            58
gender          F
job       manager
Name: 3, dtype: object
<class 'pandas.core.series.Series'>

In [102]:
print (df)
print ()
print (df.iloc[4][3], df.iloc[4]['job'], df.loc[4][3], df.loc[4]['job'])    # engineer
print (df.iloc[4, 3], df.iloc[4]['job'], df.loc[4][3], df.loc[4, 'job'])    # engineer

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

engineer engineer engineer engineer
engineer engineer engineer engineer

In [104]:
print (df.shape, len(df), df.ndim, df.size)
print (merge_outer.shape, len(merge_outer), merge_outer.ndim, merge_outer.size)

(6, 4) 6 2 24
(7, 5) 7 2 35

In [105]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [111]:
# increasing all age values by 100
df = users.copy()
for i in range(df.shape[0]):
    current_row = df.iloc[i]
    current_row.age += 100
    df.iloc[i] = current_row
df

    name  age gender        job
0  alice  119      F    student
1   john  126      M    student
2   eric  122      M    student
3   paul  158      F    manager
4  peter  133      M   engineer
5  julie  144      F  scientist

In [112]:
# import warnings
# warnings.filterwarnings('ignore')
for i in range(df.shape[0]):
    current_row = df.iloc[i]
    current_row.age += 100
    df.iloc[i] = current_row
    
df

    name  age gender        job
0  alice  219      F    student
1   john  226      M    student
2   eric  222      M    student
3   paul  258      F    manager
4  peter  233      M   engineer
5  julie  244      F  scientist

## Row Selection and Filtering

In [113]:
print (users.age < 40)
users[users.age < 40]    # select * from users where age < 40;

0     True
1     True
2     True
3    False
4     True
5    False
Name: age, dtype: bool

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

In [115]:
users[users.age < 40].job   # select job from users where age < 40

0     student
1     student
2     student
4    engineer
Name: job, dtype: object

In [116]:
users[users.age < 40]['job']

0     student
1     student
2     student
4    engineer
Name: job, dtype: object

In [117]:
users[users.age < 40][['job', 'name']]   # select job, name from users where age < 40

        job   name
0   student  alice
1   student   john
2   student   eric
4  engineer  peter

In [119]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [121]:
print ((users.age > 30) & (users.gender == 'F'))
users[(users.age > 30) & (users.gender == 'F')]

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist

In [123]:
users[(users.age > 30) & (users.gender == 'F')][['name', 'job', 'gender']]
# select name, job, gender from users where age > 30 and gender = 'F';

    name        job gender
3   paul    manager      F
5  julie  scientist      F

In [124]:
users[(users.age > 30) | (users.gender == 'F')][['name', 'job', 'gender', 'age']]

    name        job gender  age
0  alice    student      F   19
3   paul    manager      F   58
4  peter   engineer      M   33
5  julie  scientist      F   44

In [125]:
users[(users.job == "engineer") | (users.job == 'student')][['name', 'job', 'gender', 'age']]

    name       job gender  age
0  alice   student      F   19
1   john   student      M   26
2   eric   student      M   22
4  peter  engineer      M   33

In [126]:
users[users.job.isin(["engineer", 'student'])][['name', 'job', 'gender', 'age']]

    name       job gender  age
0  alice   student      F   19
1   john   student      M   26
2   eric   student      M   22
4  peter  engineer      M   33

## Sorting

In [129]:
df = users.copy()
print (df.age)
print (df.age.sort_values())
print (df.age.sort_values(ignore_index = True))

0    19
1    26
2    22
3    58
4    33
5    44
Name: age, dtype: int64
0    19
2    22
1    26
4    33
5    44
3    58
Name: age, dtype: int64
0    19
1    22
2    26
3    33
4    44
5    58
Name: age, dtype: int64

In [130]:
df.sort_values(by = 'age')

    name  age gender        job
0  alice   19      F    student
2   eric   22      M    student
1   john   26      M    student
4  peter   33      M   engineer
5  julie   44      F  scientist
3   paul   58      F    manager

In [131]:
df = df.sort_values(by = 'age', ascending = False)
df

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist
4  peter   33      M   engineer
1   john   26      M    student
2   eric   22      M    student
0  alice   19      F    student

In [137]:
df = users.copy()
df.sort_values(by = 'age', ascending = False, inplace = True, ignore_index = True)
df

    name  age gender        job
0   paul   58      F    manager
1  julie   44      F  scientist
2  peter   33      M   engineer
3   john   26      M    student
4   eric   22      M    student
5  alice   19      F    student

In [139]:
df = users.copy()
df.sort_values(by = ['job', 'age'], inplace = True, ignore_index = True)
df

    name  age gender        job
0  peter   33      M   engineer
1   paul   58      F    manager
2  julie   44      F  scientist
3  alice   19      F    student
4   eric   22      M    student
5   john   26      M    student

In [141]:
df = users.copy()
df.sort_values(by = ['job', 'age'], inplace = True)
print (df.index)
df.index = range(0, df.shape[0])
print (df.index)
df

Int64Index([4, 3, 5, 0, 2, 1], dtype='int64')
RangeIndex(start=0, stop=6, step=1)

    name  age gender        job
0  peter   33      M   engineer
1   paul   58      F    manager
2  julie   44      F  scientist
3  alice   19      F    student
4   eric   22      M    student
5   john   26      M    student

## Unpivoting and Pivoting

**Unpivot:**  Wide format (Unstacked Format) to Long format (Stacked Format)<br>
**Pivot:**    Long format (Stacked Format) to Wide format (Unstacked Format)

In [142]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [144]:
# performing the unpivot operation: Wide format to Long format
stacked = pd.melt(users, id_vars = "name", var_name = "variable", value_name = "value");
print (stacked.shape)
stacked

(18, 3)

     name variable      value
0   alice      age         19
1    john      age         26
2    eric      age         22
3    paul      age         58
4   peter      age         33
5   julie      age         44
6   alice   gender          F
7    john   gender          M
8    eric   gender          M
9    paul   gender          F
10  peter   gender          M
11  julie   gender          F
12  alice      job    student
13   john      job    student
14   eric      job    student
15   paul      job    manager
16  peter      job   engineer
17  julie      job  scientist

In [145]:
unstacked = stacked.pivot(index = 'name', columns = "variable", values = "value");
unstacked

variable age gender        job
name
alice     19      F    student
eric      22      M    student
john      26      M    student
julie     44      F  scientist
paul      58      F    manager
peter     33      M   engineer

In [150]:
unstacked = stacked.pivot(index = 'name', columns = "variable", values = "value");
unstacked

variable age gender        job
name
alice     19      F    student
eric      22      M    student
john      26      M    student
julie     44      F  scientist
paul      58      F    manager
peter     33      M   engineer

In [151]:
unstacked = stacked.pivot(index = 'name', columns = "variable", values = "value");
unstacked.reset_index(inplace = True)
unstacked.columns.name = ""
unstacked

    name age gender        job
0  alice  19      F    student
1   eric  22      M    student
2   john  26      M    student
3  julie  44      F  scientist
4   paul  58      F    manager
5  peter  33      M   engineer

In [148]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

## Quality Control: Duplicate Data

In [156]:
df = users.copy()
df = df.append(df.iloc[0])
df = df.append(df.iloc[2])
df = df.append(df.iloc[4])
df = df.append(df.iloc[3], ignore_index=True)
df.sort_values(by = "name", inplace = True)
df.index = range(0, df.shape[0])
df

    name  age gender        job
0  alice   19      F    student
1  alice   19      F    student
2   eric   22      M    student
3   eric   22      M    student
4   john   26      M    student
5  julie   44      F  scientist
6   paul   58      F    manager
7   paul   58      F    manager
8  peter   33      M   engineer
9  peter   33      M   engineer

In [157]:
print (df.duplicated().sum())
df.duplicated()

4

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7     True
8    False
9     True
dtype: bool

In [159]:
print ((~df.duplicated()).sum())
~df.duplicated()

6

0     True
1    False
2     True
3    False
4     True
5     True
6     True
7    False
8     True
9    False
dtype: bool

In [160]:
df[df.duplicated()]

    name  age gender       job
1  alice   19      F   student
3   eric   22      M   student
7   paul   58      F   manager
9  peter   33      M  engineer

In [161]:
df[~df.duplicated()]

    name  age gender        job
0  alice   19      F    student
2   eric   22      M    student
4   john   26      M    student
5  julie   44      F  scientist
6   paul   58      F    manager
8  peter   33      M   engineer

In [163]:
print (df.job.duplicated())
print (df.job.duplicated().sum())
df[df.job.duplicated()]

0    False
1     True
2     True
3     True
4     True
5    False
6    False
7     True
8    False
9     True
Name: job, dtype: bool
6

    name  age gender       job
1  alice   19      F   student
2   eric   22      M   student
3   eric   22      M   student
4   john   26      M   student
7   paul   58      F   manager
9  peter   33      M  engineer

In [165]:
print (df.duplicated(['job', 'gender']).sum())
print (df.duplicated(['job', 'gender']))
df[df.duplicated(['job', 'gender'])]

5
0    False
1     True
2    False
3     True
4     True
5    False
6    False
7     True
8    False
9     True
dtype: bool

    name  age gender       job
1  alice   19      F   student
3   eric   22      M   student
4   john   26      M   student
7   paul   58      F   manager
9  peter   33      M  engineer

In [166]:
df.drop_duplicates(inplace = True)
df.index = range(0, df.shape[0])
df

    name  age gender        job
0  alice   19      F    student
1   eric   22      M    student
2   john   26      M    student
3  julie   44      F  scientist
4   paul   58      F    manager
5  peter   33      M   engineer

## Quality Control: Missing Data

In [167]:
df = merge_left.copy()
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [168]:
df.describe(include='all')

         name        age gender      job      height
count       6   6.000000      6        6    4.000000
unique      6        NaN      2        4         NaN
top     alice        NaN      F  student         NaN
freq        1        NaN      3        3         NaN
mean      NaN  33.666667    NaN      NaN  172.750000
std       NaN  14.895189    NaN      NaN    6.344289
min       NaN  19.000000    NaN      NaN  165.000000
25%       NaN  23.000000    NaN      NaN  169.500000
50%       NaN  29.500000    NaN      NaN  173.000000
75%       NaN  41.250000    NaN      NaN  176.250000
max       NaN  58.000000    NaN      NaN  180.000000

In [169]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
 4   height  4 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 288.0+ bytes

In [170]:
print (df.height.isnull().sum())
print (df.height.isnull())
df[df.height.isnull()]

2
0    False
1    False
2    False
3     True
4     True
5    False
Name: height, dtype: bool

    name  age gender       job  height
3   paul   58      F   manager     NaN
4  peter   33      M  engineer     NaN

In [171]:
df[~df.height.isnull()]

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
5  julie   44      F  scientist   171.0

In [172]:
print (df.height.notnull().sum())
print (df.height.notnull())
df[df.height.notnull()]

4
0     True
1     True
2     True
3    False
4    False
5     True
Name: height, dtype: bool

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
5  julie   44      F  scientist   171.0

In [173]:
df.isnull()

    name    age  gender    job  height
0  False  False   False  False   False
1  False  False   False  False   False
2  False  False   False  False   False
3  False  False   False  False    True
4  False  False   False  False    True
5  False  False   False  False   False

In [174]:
df.notnull()

   name   age  gender   job  height
0  True  True    True  True    True
1  True  True    True  True    True
2  True  True    True  True    True
3  True  True    True  True   False
4  True  True    True  True   False
5  True  True    True  True    True

In [176]:
# Strategy - 1: (Deleting rows containing missing values)
df = merge_outer.copy()
print (df)
df.dropna(inplace = True)    # delete that row which is having null value in any column
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0

    name   age gender        job  height
0  alice  19.0      F    student   165.0
1   john  26.0      M    student   180.0
2   eric  22.0      M    student   175.0
5  julie  44.0      F  scientist   171.0

In [177]:
df = merge_outer.copy()
print (df)
df.dropna(how = "all", inplace = True)   # delete that row which is having null value in all columns
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0

In [180]:
# Strategy - 2: (Filling up missing values)
df = merge_outer.copy()
print (df)
df.fillna(0, inplace = True)    # filling with 0 value
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     0.0
4     peter  33.0      M   engineer     0.0
5     julie  44.0      F  scientist   171.0
6  anderson   0.0      0          0   169.0

In [181]:
df = merge_outer.copy()
print (df)
print (df.height.mean())
df.fillna(df.height.mean(), inplace = True)    # filling with 0 value
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0
172.0

       name    age gender        job  height
0     alice   19.0      F    student   165.0
1      john   26.0      M    student   180.0
2      eric   22.0      M    student   175.0
3      paul   58.0      F    manager   172.0
4     peter   33.0      M   engineer   172.0
5     julie   44.0      F  scientist   171.0
6  anderson  172.0  172.0      172.0   169.0

In [182]:
df = merge_outer.copy()
df.sort_values(by = 'age', inplace = True)
print (df)
df.index = range(0, df.shape[0])
df.fillna(method = 'pad', inplace = True)    # forward fill
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
2      eric  22.0      M    student   175.0
1      john  26.0      M    student   180.0
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
3      paul  58.0      F    manager     NaN
6  anderson   NaN    NaN        NaN   169.0

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      eric  22.0      M    student   175.0
2      john  26.0      M    student   180.0
3     peter  33.0      M   engineer   180.0
4     julie  44.0      F  scientist   171.0
5      paul  58.0      F    manager   171.0
6  anderson  58.0      F    manager   169.0

In [184]:
df = merge_outer.copy()
print (df)
df.fillna(method = 'pad', inplace = True)    # forward fill
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager   175.0
4     peter  33.0      M   engineer   175.0
5     julie  44.0      F  scientist   171.0
6  anderson  44.0      F  scientist   169.0

In [185]:
df = merge_outer.copy()
df.sort_values(by = 'age', inplace = True)
df.index = range(0, df.shape[0])
print (df)
df.fillna(method = 'bfill', inplace = True)    # backward fill
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      eric  22.0      M    student   175.0
2      john  26.0      M    student   180.0
3     peter  33.0      M   engineer     NaN
4     julie  44.0      F  scientist   171.0
5      paul  58.0      F    manager     NaN
6  anderson   NaN    NaN        NaN   169.0

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      eric  22.0      M    student   175.0
2      john  26.0      M    student   180.0
3     peter  33.0      M   engineer   171.0
4     julie  44.0      F  scientist   171.0
5      paul  58.0      F    manager   169.0
6  anderson   NaN    NaN        NaN   169.0

## Rename Column Names

In [188]:
df = users.copy()
print (df)
print (df.columns)
df = df.rename(columns = {'name':'emp_name', 'age':'emp_age','gender':'emp_gender','job':'emp_job'});
print (df)
df = df.rename(columns = {'emp_name':'new_name', 'emp_gender':'new_gender'});
print (df)

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist
Index(['name', 'age', 'gender', 'job'], dtype='object')
  emp_name  emp_age emp_gender    emp_job
0    alice       19          F    student
1     john       26          M    student
2     eric       22          M    student
3     paul       58          F    manager
4    peter       33          M   engineer
5    julie       44          F  scientist
  new_name  emp_age new_gender    emp_job
0    alice       19          F    student
1     john       26          M    student
2     eric       22          M    student
3     paul       58          F    manager
4    peter       33          M   engineer
5    julie       44          F  scientist

In [190]:
df = users.copy()
new_column_names = ['emp_name', 'emp_age', 'emp_gender', 'emp_job']
print (df.columns)
df.columns = new_column_names
print (df.columns)
df

Index(['name', 'age', 'gender', 'job'], dtype='object')
Index(['emp_name', 'emp_age', 'emp_gender', 'emp_job'], dtype='object')

  emp_name  emp_age emp_gender    emp_job
0    alice       19          F    student
1     john       26          M    student
2     eric       22          M    student
3     paul       58          F    manager
4    peter       33          M   engineer
5    julie       44          F  scientist

## Groupby on DataFrame

In [199]:
try:
    print ("Reading data from the .CSV file...")
    # df = pd.read_csv("./salary_table.csv")
    # df = pd.read_csv("salary_table.csv")
    # df = pd.read_csv("C:\\Users\Arnab\AEC ML with Python Jan 2024\salary_table.csv")
    # df = pd.read_csv("C:\\Users\\Arnab\\AEC ML with Python Jan 2024\\salary_table.csv")
    # df = pd.read_csv("C:/Users/Arnab/AEC ML with Python Jan 2024/salary_table.csv")
    # df = pd.read_csv("C://Users//Arnab//AEC ML with Python Jan 2024//salary_table.csv")
    df = pd.read_csv("C://Users/Arnab\AEC ML with Python Jan 2024\\salary_table.csv")
    print ("Data has been read successfully...")
except:
    print ("File access error !!!")
    print ("Data file could not be read successfully...")
    
df.head()

Reading data from the .CSV file...
Data has been read successfully...

   salary  experience education management
0   13876           1  Bachelor          Y
1   11608           1      Ph.D          N
2   18701           1      Ph.D          Y
3   11283           1    Master          N
4   11767           1      Ph.D          N

In [200]:
try:
    print ("Reading data from the .XLSX file...")
    df = pd.read_excel("./Online Retail.xlsx")
    print ("Data has been read successfully...")
except:
    print ("File access error !!!")
    print ("Data file could not be read successfully...")
    
df.tail()

Reading data from the .XLSX file...
Data has been read successfully...

,INVOICENO,STOCKCODE,DESCRIPTION,QUANTITY,INVOICEDATE,UNITPRICE,CUSTOMERID,COUNTRY
10,536370,22728,ALARM CLOCK BAKELIKE PINK,24,2010-12-01 08:45:00,3.75,12583,France
11,536370,22727,ALARM CLOCK BAKELIKE RED,24,2010-12-01 08:45:00,3.75,12583,France
12,536370,21791,VINTAGE HEADS AND TAILS CARD GAME,24,2010-12-01 08:45:00,1.25,12583,France
13,536370,21035,SET/2 RED RETROSPOT TEA TOWELS,18,2010-12-01 08:45:00,2.95,12583,France
14,536527,POST,POSTAGE,1,2010-12-01 13:04:00,18.00,12662,Germany

In [202]:
try:
    print ("Reading data from the .XLSX file...")
    df = pd.read_excel("./Online Retail.xlsx", sheet_name = 'Sheet1')
    print ("Data has been read successfully...")
except:
    print ("File access error !!!")
    print ("Data file could not be read successfully...")
    
df.tail()

Reading data from the .XLSX file...
Data has been read successfully...

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
10,536370,22728,ALARM CLOCK BAKELIKE PINK,24,2010-12-01 08:45:00,3.75,12583,France
11,536370,22727,ALARM CLOCK BAKELIKE RED,24,2010-12-01 08:45:00,3.75,12583,France
12,536370,21791,VINTAGE HEADS AND TAILS CARD GAME,24,2010-12-01 08:45:00,1.25,12583,France
13,536370,21035,SET/2 RED RETROSPOT TEA TOWELS,18,2010-12-01 08:45:00,2.95,12583,France
14,536527,POST,POSTAGE,1,2010-12-01 13:04:00,18.00,12662,Germany

## Insert and Delete Columns and Replace Column Values

In [204]:
try:
    print ("Reading data from the .XLSX file...")
    df = pd.read_excel("./Online Retail.xlsx")
    print ("Data has been read successfully...")
except:
    print ("File access error !!!")
    print ("Data file could not be read successfully...")
    
df.tail()

Reading data from the .XLSX file...
Data has been read successfully...

,INVOICENO,STOCKCODE,DESCRIPTION,QUANTITY,INVOICEDATE,UNITPRICE,CUSTOMERID,COUNTRY
10,536370,22728,ALARM CLOCK BAKELIKE PINK,24,2010-12-01 08:45:00,3.75,12583,France
11,536370,22727,ALARM CLOCK BAKELIKE RED,24,2010-12-01 08:45:00,3.75,12583,France
12,536370,21791,VINTAGE HEADS AND TAILS CARD GAME,24,2010-12-01 08:45:00,1.25,12583,France
13,536370,21035,SET/2 RED RETROSPOT TEA TOWELS,18,2010-12-01 08:45:00,2.95,12583,France
14,536527,POST,POSTAGE,1,2010-12-01 13:04:00,18.00,12662,Germany

In [208]:
df1 = df.copy()
df1 = df1[["INVOICENO", "UNITPRICE", "CUSTOMERID", "COUNTRY"]]
df1.head()

   INVOICENO  UNITPRICE  CUSTOMERID         COUNTRY
0     536365       2.55       17850  United Kingdom
1     536365       3.39       17850  United Kingdom
2     536365       2.75       17850  United Kingdom
3     536365       3.39       17850  United Kingdom
4     536403       1.85       12791     Netherlands

In [211]:
df1.drop("INVOICENO", axis = 1, inplace = True)    # deleting column 'INVOICENO'
df1.head()

   UNITPRICE  CUSTOMERID         COUNTRY
0       2.55       17850  United Kingdom
1       3.39       17850  United Kingdom
2       2.75       17850  United Kingdom
3       3.39       17850  United Kingdom
4       1.85       12791     Netherlands

In [212]:
df1.insert(1, 'TAX', df1.UNITPRICE * 0.10)    # inserting column 'TAX' at index 1
df1.head()

   UNITPRICE    TAX  CUSTOMERID         COUNTRY
0       2.55  0.255       17850  United Kingdom
1       3.39  0.339       17850  United Kingdom
2       2.75  0.275       17850  United Kingdom
3       3.39  0.339       17850  United Kingdom
4       1.85  0.185       12791     Netherlands

In [213]:
df1

    UNITPRICE    TAX  CUSTOMERID         COUNTRY
0        2.55  0.255       17850  United Kingdom
1        3.39  0.339       17850  United Kingdom
2        2.75  0.275       17850  United Kingdom
3        3.39  0.339       17850  United Kingdom
4        1.85  0.185       12791     Netherlands
5       15.00  1.500       12791     Netherlands
6        8.50  0.850       12431       Australia
7        4.95  0.495       12431       Australia
8        1.25  0.125       12431       Australia
9        5.45  0.545       12431       Australia
10       3.75  0.375       12583          France
11       3.75  0.375       12583          France
12       1.25  0.125       12583          France
13       2.95  0.295       12583          France
14      18.00  1.800       12662         Germany

In [214]:
# replacing COUNTRY column values
df1['COUNTRY'].replace({"France":"Fr", "United Kingdom":"UK", "Australia":"Aus", 
                        "Netherlands":"Ned", "Germany":"Gr"}, inplace = True)
df1

    UNITPRICE    TAX  CUSTOMERID COUNTRY
0        2.55  0.255       17850      UK
1        3.39  0.339       17850      UK
2        2.75  0.275       17850      UK
3        3.39  0.339       17850      UK
4        1.85  0.185       12791     Ned
5       15.00  1.500       12791     Ned
6        8.50  0.850       12431     Aus
7        4.95  0.495       12431     Aus
8        1.25  0.125       12431     Aus
9        5.45  0.545       12431     Aus
10       3.75  0.375       12583      Fr
11       3.75  0.375       12583      Fr
12       1.25  0.125       12583      Fr
13       2.95  0.295       12583      Fr
14      18.00  1.800       12662      Gr

In [215]:
df1['COUNTRY'].replace(["Fr", "UK", "Aus", "Ned", "Gr"], ["France", "United Kingdom", 
                        "Australia", "Netherlands", "Germany"], inplace = True)
df1

    UNITPRICE    TAX  CUSTOMERID         COUNTRY
0        2.55  0.255       17850  United Kingdom
1        3.39  0.339       17850  United Kingdom
2        2.75  0.275       17850  United Kingdom
3        3.39  0.339       17850  United Kingdom
4        1.85  0.185       12791     Netherlands
5       15.00  1.500       12791     Netherlands
6        8.50  0.850       12431       Australia
7        4.95  0.495       12431       Australia
8        1.25  0.125       12431       Australia
9        5.45  0.545       12431       Australia
10       3.75  0.375       12583          France
11       3.75  0.375       12583          France
12       1.25  0.125       12583          France
13       2.95  0.295       12583          France
14      18.00  1.800       12662         Germany

In [216]:
# factorizing COUNTRY column values
df1.insert(4, 'COUNTRY_CODE',  pd.factorize(df1['COUNTRY'])[0])
print (df1)

    UNITPRICE    TAX  CUSTOMERID         COUNTRY  COUNTRY_CODE
0        2.55  0.255       17850  United Kingdom             0
1        3.39  0.339       17850  United Kingdom             0
2        2.75  0.275       17850  United Kingdom             0
3        3.39  0.339       17850  United Kingdom             0
4        1.85  0.185       12791     Netherlands             1
5       15.00  1.500       12791     Netherlands             1
6        8.50  0.850       12431       Australia             2
7        4.95  0.495       12431       Australia             2
8        1.25  0.125       12431       Australia             2
9        5.45  0.545       12431       Australia             2
10       3.75  0.375       12583          France             3
11       3.75  0.375       12583          France             3
12       1.25  0.125       12583          France             3
13       2.95  0.295       12583          France             3
14      18.00  1.800       12662         Germany             4

## Pupulating Data on DataFrame in Google Colab

## Startegy - 1

In [ ]:
from google.colab import files
uploaded = files.upload()

In [ ]:
import io
import pandas as pd
df1 = pd.read_csv(io.BytesIO(uploaded['salary_table.csv']))
df1.head()

## Startegy - 2

In [ ]:
from google.colab import drive
drive.mount("/content/gdrive")

In [ ]:
import pandas as pd
# prior upload the data file in the Gdrive
df = pd.read_csv("/content/gdrive/My Drive/iris.csv")  
df.head()